
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   13.1   Copyright 1985-2013 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

3-user Stata network perpetual license:
       Serial number:  501306208483
         Licensed to:  Jakob Schwerter
                       

Notes:
      1.  (-set maxvar-) 5000 maximum variables
      2.  Stata running in batch mode

. do /Users/jakobschwerter/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. log using "/Users/jakobschwerter/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jakobschwerter/.ipython/stata/log_output.log
  log type:  text
 opened on:  14 Apr 2016, 14:38:41

. timer on 1

. set seed 100

. capture program drop mcprog_pool

. program mcprog_pool
  1.         clear
  2.         drawnorm alpha_i, n(200)
  3.         gen i = _n 
  4.         expand 5
  5.         bys i: g t = _n 
  6.         drawnorm nu_it e_it, n(1000)
  7.         g x_it=nu_it+alpha_i
  8.         g y_it=3+alpha_i+2*x_it+e_it
  9.         reg y_it x_it, 
 10.         drop nu_it alpha_i e_it y_it x_it
 11. end

.         simulate _b _se, nodots nolegend  reps(1000): mcprog_pool


.         rename _b_x_it beta_pool

.         rename _se_x_it se_pool

.         keep beta_pool se_pool

. timer off 1

. display "The time this code runs is"
The time this code runs is

. timer list 1
   1:     11.59 /        1 =      11.5890

. log close
      name:  <unnamed>
       log:  /Users/jakobschwerter/.ipython/stata/log_output.log
  log type:  text
 closed on:  14 Apr 2016, 14:38:53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. save "/Users/jakobschwerter/.ipython/stata/data_output.dta", replace 
file /Users/jakobschwerter/.ipython/stata/data_output.dta saved

. 
. 
end of do-file
